app/Models/Konfigurasi_model.php

SELECT *
FROM `konfigurasi`
---
    public function listing()
    {
        // Mengakses tabel 'konfigurasi'
        $builder = $this->db->table('konfigurasi');

        // Mengambil semua data dari tabel
        $builder->select('*');
        $query = $builder->get();